app/views/employees/_form.html.erb

  <span class="help-inline">
    <%= @employee.errors[:birthdate].any? ? @employee.errors[:birthdate].to_s[/\w([^"]*)/] : "" %></span>
  </div>
  </div>
  </div>


  <div class="clearfix"></div>
 <h2>Detalle del empleado</h2>
<div class="x_title"></div>
 <br>

 <div class="col-md-4 col-sm-6 col-xs-12 form-group">
  <div class="control-group<%= @employee.errors[:company_id].any? ? " error" : "" %>">
    <%= f.label :company_id, 'Empresa' %><br>
    <div class="controls">
    <%=f.select :company_id, current_user.companies.all.collect {|p| [ p.company_name, p.id ] }, { :include_blank => '-Seleccionar empresa-'}, { :class=>"form-control"}%>
  <span class="help-inline">
    <%= @employee.errors[:company_id].any? ? @employee.errors[:company_id].to_s[/\w([^"]*)/] : "" %></span>
  </div>
  </div>
  </div>
---
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = $1  [["user_id", 1]]

  <span class="help-inline">
    <%= @employee.errors[:employee_key].any? ? @employee.errors[:employee_key].to_s[/\w([^"]*)/] : "" %></span>
  </div>
  </div>
  </div>

  <div class="col-md-4 col-sm-6 col-xs-12 form-group">
  <div class="control-group<%= @employee.errors[:payment_cycle].any? ? " error" : "" %>">
    <%= f.label :payment_cycle, 'Ciclo de pago' %><br>
    <div class="controls">
    <%=f.select :payment_cycle, [['Diario', "Diario"], ['Semanal', "Semanal"], ['Quincenal', "Quincenal"], ['Mensual', "Mensual"]], {}, { :class=>"form-control"}%>
  <span class="help-inline">
    <%= @employee.errors[:payment_cycle].any? ? @employee.errors[:payment_cycle].to_s[/\w([^"]*)/] : "" %></span>
  </div>
  </div>
  </div>

  <div class="col-md-4 col-sm-6 col-xs-12 form-group">
  <div class="control-group<%= @employee.errors[:card_id].any? ? " error" : "" %>">
    <%= f.label :card_id, 'Tarjeta' %><br>
    <div class="controls">
    <%=f.select :card_id, Card.all.collect {|p| [ p.cardNumber, p.id ] }, { :include_blank => '-Seleccionar tarjeta-'}, { :class=>"form-control"}%>
---
SELECT "cards".* FROM "cards"