app/views/loans/_form.html.erb

      <div class="controls">
      <%=f.select :employee_id, current_user.companies.map(&:employees).flatten.collect {|p|  ["#{p.first_name} #{p.p_last_name} #{p.m_last_name}", p.id ] if p.id.to_i == id_trabajador.to_i}, {:include_blank => 'Cliente'},{ :class=>"form-control"}%>
---
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = $1  [["user_id", 1]]

      <span class="help-inline">
      <%= @loan.errors[:max_credit].any? ? @loan.errors[:max_credit].to_s[/\w([^"]*)/] : "" %></span>
      </div>
      </div>
      </div>

        <div class="col-md-4 col-sm-6 col-xs-12 form-group">
      <div class="control-group<%= @loan.errors[:period].any? ? " error" : "" %>">
           <%= f.label :period, "Periodo" %>
      <br>
      <div class="controls">
      <%= f.text_field :period, :class => 'form-control', :value=>Loan.get_period %>
      <span class="help-inline">
      <%= @loan.errors[:period].any? ? @loan.errors[:period].to_s[/\w([^"]*)/] : "" %></span>
      </div>
      </div>
      </div>


        <div class="col-md-4 col-sm-6 col-xs-12 form-group">
      <div class="control-group<%= @loan.errors[:capital_requisition].any? ? " error" : "" %>">
      <%= f.label :capital_requisition, "Capital de requisición"%>
---
SELECT "loans".* FROM "loans"