app/views/loans/index.xls.erb

  <tr>
<td><%= product.employee.first_name %> </td>
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]