app/views/loans/show.html.erb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
                      <div class="col-md-6 col-sm-6 col-xs-12">
                        <input type="text" disabled="true" class="form-control col-md-7 col-xs-12" value="<%= @loan.employee.first_name%> <%= @loan.employee.p_last_name %> <%= @loan.employee.m_last_name %>">