app/controllers/cards_controller.rb

def index

  @card = Card.paginate(:page => params[:page], :per_page => 15)
---
SELECT "cards".* FROM "cards"  ORDER BY id DESC

  def create
    @card = Card.new(card_params)
    @tar = card_params[:cardNumber]
    #raise"#{card_params}"
    if verificar == true
      redirect_to cards_url, notice: "Tarjeta Duplicada Ingresa Otra"
    else
    respond_to do |format|
      if @card.save
---
INSERT INTO "cards" ("cardNumber", "emisor", "statuss", "expDate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cardNumber", "4000123456789010"], ["emisor", "Banamex"], ["statuss", 0], ["expDate", "2016-09-22"], ["created_at", "2016-09-22 21:39:03.973453"], ["updated_at", "2016-09-22 21:39:03.973453"]]

  def destroy
    @card.destroy
---
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 1]]

  def import
    if params.include?("file") or params.include?(".csv") or params.include?(".xls") or params.include?(".xlsx")
      Card.import(params[:file])
      redirect_to cards_url, notice:  Card.count == @count_init ? "Tarjeta(s) Con valores Diferentes": "Tarjeta(s) importada(s)."
---
SELECT COUNT(*) FROM "cards"