app/controllers/companies_controller.rb

  def index
    @companies = current_user.companies.paginate(:page => params[:page], :per_page => 15)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = $1 LIMIT 15 OFFSET 0  [["user_id", 1]]

  def create
    company_params[:rfc_company].upcase!
    company_params[:rfc_agent].upcase!
    company_params[:contact_name].capitalize!
    company_params[:contact_p_last_name].capitalize!
    company_params[:contact_m_last_name].capitalize!
    company_params[:agent_name].capitalize!
    company_params[:agent_p_last_name].capitalize!
    company_params[:agent_m_last_name].capitalize!
    company_params[:location].capitalize!
    company_params[:delegation].capitalize!
    company_params[:city].capitalize!


    @company = current_user.companies.build(company_params)
    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("company_name", "sub_company", "street", "num_out", "num_int", "location", "delegation", "city", "cp", "payment_schema", "contact_name", "contact_p_last_name", "contact_m_last_name", "contact_email", "contact_telephone", "rfc_company", "agent_name", "agent_p_last_name", "agent_m_last_name", "agent_email", "agent_telephone", "rfc_agent", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"

  def update
    company_params[:rfc_company].upcase!
    company_params[:rfc_agent].upcase!
    company_params[:contact_name].capitalize!
    company_params[:contact_p_last_name].capitalize!
    company_params[:contact_m_last_name].capitalize!
    company_params[:agent_name].capitalize!
    company_params[:agent_p_last_name].capitalize!
    company_params[:agent_m_last_name].capitalize!
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE "companies" SET "contact_m_last_name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["contact_m_last_name", "Herrer"], ["updated_at", "2016-09-22 23:05:38.068820"], ["id", 1]]