app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" LIMIT 15 OFFSET 0
---
  def index
    @employees = Employee.paginate(:page => params[:page], :per_page => 15)

INSERT INTO "employees" ("first_name", "curp", "net_monthly_salary", "employee_key", "payment_cycle", "card_id", "company_id", "mobile_number", "phone", "activation_code", "p_last_name", "m_last_name", "place_birth", "brut_monthly_salary", "disponible", "credit_line", "admission_date", "birthdate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    employee_params[:curp].upcase!
    employee_params[:first_name].capitalize!
    employee_params[:p_last_name].capitalize!
    employee_params[:m_last_name].capitalize!
    #employee_params[:employee_key].to_s


    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "net_monthly_salary" = $1, "credit_line" = $2, "updated_at" = $3 WHERE "employees"."id" = $4  [["net_monthly_salary", 15000.0], ["credit_line", "4500"], ["updated_at", "2016-09-23 04:15:56.242462"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)