app/controllers/loans_controller.rb

SELECT "loans".* FROM "loans"
---
  def index
    @loan = Loan.all

INSERT INTO "loans" ("employee_id", "net_salary", "interest", "max_credit", "period", "capital_requisition", "capital_to_pay", "balance", "status", "date_requisition", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @loan = Loan.new(loan_params)
    @id_ploy = loan_params[:employee_id]
    @max = loan_params[:capital_requisition]
    cd = loan_params[:max_credit]

    if verificar == true
      respond_to do |format|
        if @loan.save

SELECT  "loans".* FROM "loans" WHERE "loans"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_loan
      @loan = Loan.find(params[:id])

INSERT INTO "pagos" ("monto_pago", "interes", "iva_sobre_interes", "total", "status_pago", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def set_pago
      m = loan_params[:capital_requisition].to_i
      if m==0

      else

      i = loan_params[:interest].to_i
      inters =  (m * i).to_f / 100
      iva_interes = inters * 16 / 100.0
      t =  inters + iva_interes + m
      h = Hash.new
      h = {'monto_pago' => loan_params[:capital_requisition],
           'interes' => inters,
           'iva_sobre_interes' => iva_interes,
           'total' => t,
           'status_pago' => 'Pendiente'
          }
      @pago = Pago.new(h)
      @pago.save