app/controllers/pagos_controller.rb

  def index
     @pago = Pago.paginate(:page => params[:page], :per_page => 15)
---
SELECT  "pagos".* FROM "pagos" LIMIT 15 OFFSET 0