app/controllers/plainpage_controller.rb

  def index

    @total_comp = Company.count
    @total_subcom = Company.order(:sub_company).count
    @total_cliente = Employee.count
    @total_tajetas_ac = Card.where(statuss: 2).count
    @total_pagos = Pago.where(status_pago: 'Pendiente').sum(:total)
    @mes_ante_comp = Company.where(created_at: (Time.now.midnight - 1.month)..Time.now.midnight).count
    @mes_ante_subcom = Company.order(:sub_company).where(created_at: (Time.now.midnight - 1.month)..Time.now.midnight).count
    @mes_ante_clien = Employee.where(created_at: (Time.now.midnight - 1.month)..Time.now.midnight).count
    @mes_ante_tar = Card.where(expDate: (Time.now.midnight - 1.month)..Time.now.midnight).count
    @mes_ante_pag = Pago.where(created_at: (Time.now.midnight - 1.month)..Time.now.midnight).count
---
SELECT COUNT(*) FROM "companies" WHERE ("companies"."created_at" BETWEEN '2016-08-22 05:00:00.000000' AND '2016-09-22 05:00:00.000000')
SELECT COUNT(*) FROM "employees" WHERE ("employees"."created_at" BETWEEN '2016-08-22 05:00:00.000000' AND '2016-09-22 05:00:00.000000')
SELECT COUNT(*) FROM "cards" WHERE "cards"."statuss" = $1  [["statuss", 2]]
SELECT SUM("pagos"."total") FROM "pagos" WHERE "pagos"."status_pago" = $1  [["status_pago", "Pendiente"]]
SELECT COUNT(*) FROM "cards" WHERE ("cards"."expDate" BETWEEN '2016-08-22 05:00:00.000000' AND '2016-09-22 05:00:00.000000')
SELECT COUNT(*) FROM "pagos" WHERE ("pagos"."created_at" BETWEEN '2016-08-22 05:00:00.000000' AND '2016-09-22 05:00:00.000000')